# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'


brew 'android-platform-tools'
brew 'automake'
brew 'awscli'
brew 'bash-completion@2'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'cmake'
brew 'composer'
brew 'coreutils' # Those that come with macOS are outdated
brew 'entr'
brew 'ffmpeg'
brew 'findutils'
brew 'fish'
brew 'fzf'
brew 'gh'
brew 'gifsicle'
brew 'git-delta'
brew 'git'
brew 'glances'
brew 'gnu-sed'
brew 'gnupg'
brew 'go'
brew 'grep'
brew 'gron'
brew 'httpie'
brew 'imagemagick'
brew 'jpegoptim'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'meilisearch'
brew 'moreutils'
brew 'mtr'
brew 'mysql'
brew 'nano'
brew 'ncdu' # find where your diskspace went
brew 'nginx'
brew 'node' 
brew 'openssh'
brew 'optipng'
brew 'php'
brew 'php@7.4'
brew 'php@8.0'
brew 'pidcat' # colored logcat guy
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'pngquant'
brew 'redis'
brew 'rename'
brew 'rust'
brew 'scrcpy' # control/view android phone from PC. amazing
brew 'shellcheck'
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svgo'
brew 'svn' # Needed to install fonts
brew 'the_silver_searcher'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'yarn'
brew 'youtube-dl'
brew 'z'
brew 'zopfli'
brew 'zsh'
brew 'lastpass-cli'
brew 'onedrive'
brew 'syntax-highlight'
brew 'termius'
brew 'textmate'
brew 'wireguard-tools'
brew 'wireguard-go'
brew 'winetricks'


cask 'adium'
cask 'adobe-creative-cloud'
cask 'airdroid'
cask 'alfred'
cask 'android-studio'
cask 'apparency'
cask 'audio-hijack'
cask 'balenaetcher'
cask 'bartender'
cask 'betterzip'
cask 'caffeine'
cask 'carbon-copy-cloner'
cask 'chrome-devtools'
cask 'chrome-remote-desktop-host'
cask 'cleanmymac'
cask 'coconutbattery'
cask 'cyberduck'
cask 'daisydisk'
cask 'dbngin'
cask 'debookee'
cask 'discord'
cask 'disk-inventory-x'
cask 'ditto'
cask 'docker'
cask 'dotnet-sdk'
cask 'dropbox'
cask 'elmedia-player'
cask 'evernote'
cask 'farrago'
cask 'fig'
cask 'figma'
cask 'firefox'
cask 'fission'
cask 'gas-mask'
cask 'gimp'
cask 'github'
cask 'google-assistant'
cask 'google-chrome'
cask 'google-drive'
cask 'google-earth-pro'
cask 'gotomeeting'
cask 'gpg-suite'
cask 'gpgtools'
cask 'grammarly'
cask 'gyazo'
cask 'helo'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'jdownloader'
cask 'keka'
cask 'lastpass'
cask 'limechat'
cask 'loopback'
cask 'lulu'
cask 'mamp'
cask 'microsoft-office'
cask 'microsoft-teams'
cask 'netspot'
cask 'omnidisksweeper'
cask 'openemu'
cask 'parsec'
cask 'pastebot'
cask 'phpmon'
cask 'plex'
cask 'plistedit-pro'
cask 'postman-agent'
cask 'postman'
cask 'powershell'
cask 'pritunl'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'
cask 'quicklookase'
cask 'radio-silence'
cask 'ray'
cask 'rectangle-pr'
cask 'rectangle'
cask 'rescuetime'
cask 'screenflow'
cask 'skitch'
cask 'slack'
cask 'soundsource'
cask 'splashtop-business'
cask 'splashtop-streamer'
cask 'spotify'
cask 'sqlpro-studio'
cask 'steam'
cask 'steamcmd'
cask 'sublime-text'
cask 'suspicious-package'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'unetbootin'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'vnc-viewer'
cask 'whatsapp'
cask 'wifi-explorer-pro'
cask 'wine-stable'
cask 'zenmap'
cask 'zoom'


# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


# Mac App Store
#mas install 1384080005
mas install 1037126344
mas install 1153157709
mas install 1176895641
mas install 409183694
mas install 409203825
mas install 420212497
mas install 472226235
mas install 668208984
mas install 904280696
mas install 937984704























