# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'bat' # Used for spatie/visit
brew 'coreutils' # Those that come with macOS are outdated
brew 'fish'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'jq' # Used for spatie/visit
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'stripe/stripe-mock/stripe-mock'
brew 'svn' # Needed to install fonts
brew 'the_silver_searcher'
brew 'fzf'
brew 'imagemagick'
brew 'node' 
brew 'rename'
brew 'tree'
brew 'zopfli'
brew 'ffmpeg'
brew 'jq'
brew 'gron'
brew 'zsh'
# Note: don’t forget to add `/usr/local/bin/<EACHSHELL>` to `/etc/shells` before running `chsh`.

# Spatie Medialibrary
brew 'jpegoptim'
brew 'optipng'
brew 'pngquant'
brew 'svgo'
brew 'gifsicle'

# Development
brew 'automake'
brew 'cmake'
brew 'composer'
brew 'go'
brew 'imagemagick'
brew 'meilisearch'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'php'
brew 'php@8.0'
brew 'php@7.4'
brew 'redis'
brew 'rust'
brew 'yarn'

# GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'

brew 'bash-completion@2'
brew 'wget'

# Install more recent versions of some OS X tools
brew 'vim'
brew 'nano'
brew 'grep'
brew 'openssh'

brew 'z'
brew 'entr'
brew 'gh'
brew 'git-delta'
brew 'glances'
brew 'shellcheck'

brew 'android-platform-tools'
brew 'pidcat'   # colored logcat guy
brew 'ncdu' # find where your diskspace went
brew 'scrcpy' # control/view android phone from PC. amazing
brew 'youtube-dl'

brew 'mtr'


# Apps
cask '1password'
cask 'caffeine'
cask 'dbngin'
cask 'discord'
cask 'docker'
cask 'dotnet-sdk'
cask 'figma'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'gpg-suite'
cask 'helo'
cask 'imageoptim'
cask 'insomnia'
cask 'pastebot'
cask 'phpmon'
cask 'powershell'
cask 'ray'
cask 'screenflow'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tinkerwell'
cask 'transmit'
cask 'tunnelbear'
cask 'tuple'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'

cask 'rectangle'
cask 'rescuetime'
cask 'iterm2'
cask 'sublime-text'
cask 'imageoptim'
cask 'visual-studio-code'
cask 'limechat'
cask 'disk-inventory-x'
cask 'screenflow'
cask 'vlc'
cask 'gpgtools'
cask 'spotify'

cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'qlimagesize'
cask 'suspicious-package'
cask 'apparency'
cask 'quicklookase'
cask 'qlvideo'

# Fonts
cask 'font-fira-code'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'


#—


# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Spark', id: 1176895641
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
#mas 'Tweetbot', id: 1384080005
